import math
import numpy #модуль с массивами и мат. ф-ми
import matplotlib.pyplot as plt #плотит графики

"""
a = numpy.zeros([2,3]) #двумерный массив с нулями
b = numpy.ones([2,3])  #двумерный массив с единицами

print(a)

c = numpy.arange(0,10,0.1) #одномерный массив заполняемый по диапазону
print(c)
"""

#теоретическая фаза
x = numpy.arange(0, 1000001,25000)
y = numpy.arctan(1/(2*10**(-5)*math.pi*x))
plt.plot(x, y, marker='o', label='Теория')

#практическая фаза
a = numpy.array([100, 250, 500, 1000, 1500, 2000, 3000, 4000, 5000, 6000, 7000, 8000, 9000, 10000, 15000, 20000, 25000,
                 30000, 40000, 50000, 60000, 70000, 80000, 90000, 100000, 200000, 500000, 1000000])
b = numpy.arcsin(numpy.array([16.4/16.4, 16.4/16.4, 16.4/16.4, 16.4/16.4, 16.4/16.4, 16/16.4, 15.6/16.4, 15.2/16.4,
                              14.8/16.6, 15/16.4, 14.4/16.4, 13.8/16.4, 13.6/16, 13.2/16.4, 11.2/16, 9.2/16, 7.8/16,
                              6.6/16, 5.2/16, 4.4/16, 3.6/16, 3.2/16, 2.4/16, 2.2/16, 2/16, 0.8/15.4, 0/12.6,
                              0/8.16]))
print(b)
plt.plot(a, b, marker='^', label='Практика')

plt.xticks(numpy.arange(0,1000001,50000))
plt.grid(color = 'black')
plt.title('Фазовая хар-ка дифференцирующего четырехполюсника')
plt.legend(loc='upper right')
plt.xlabel('w/2pi')
plt.ylabel('Arg(w/2pi)')
plt.show()
#дз поставить anaconda navigator и нарисовать что-нибудь