import math
import numpy #модуль с массивами и мат. ф-ми
import matplotlib.pyplot as plt #плотит графики

"""
a = numpy.zeros([2,3]) #двумерный массив с нулями
b = numpy.ones([2,3])  #двумерный массив с единицами

print(a)

c = numpy.arange(0,10,0.1) #одномерный массив заполняемый по диапазону
print(c)
"""

#теоретический коэф. усиления
x = numpy.arange(0, 1000001,25000)
y = 2*10**(-5)*math.pi*x/((2*10**(-5)*math.pi*x)**2 + 1)**0.5
plt.plot(x, y, marker='o', label='Теория')

#практический коэф. усиления
a = numpy.array([100, 250, 500, 1000, 1500, 2000, 3000, 4000, 5000, 6000, 7000, 8000, 9000, 10000, 15000, 20000, 25000,
                 30000, 40000, 50000, 60000, 70000, 80000, 90000, 100000, 200000, 500000, 1000000])
b = numpy.array([0.116/16.4, 0.32/16.4, 0.56/16.4, 1.08/16.4, 1.52/16.4, 2.04/16.4, 2.96/16.4, 3.8/16.4, 4.64/16.6,
                 5.44/16.4, 6.16/16.4, 6.8/16.4, 7.4/16, 8.04/16.4, 10.2/16, 11.2/16, 12/16, 12.5/16, 13/16, 13.2/16,
                 13.3/16, 13.6/16, 13.6/16, 13.4/16, 13.5/16, 13.4/15.4, 11/12.6, 7.28/8.16])
print(b)
plt.plot(a, b, marker='^', label='Практика')

plt.xticks(numpy.arange(0,1000001,50000))
plt.grid(color = 'black')
plt.title('Коэф-т передачи дифференцирующего четырехполюсника')
plt.legend(loc='upper right')
plt.xlabel('w/2pi')
plt.ylabel('K(w/2pi)')
plt.show()
#дз поставить anaconda navigator и нарисовать что-нибудь